app/Controllers/Product.php

INSERT INTO "products" ("name", "description", "price", "amount", "code", "created_at", "updated_at") VALUES ('Sabão', 'Em pó', '99.8', '1', '54564', '2023-10-16 14:51:58', '2023-10-16 14:51:58')
---
    public function create()
    {
        $product = new ProductModel();
        $data = $this->request->getPost();

        if ($this->validate('products')) {

            $id = $product->insert([
                'name' => $data['name'],
                'description' => $data['description'],
                'price' => $data['price'],
                'amount' => $data['amount'],
                'code' => $data['code']
            ]);

SELECT *
FROM "products"
WHERE "products"."id" = '12'
DELETE FROM "products"
WHERE "id" IN ('12')
---
    public function delete($id = null)
    {
        $product = new ProductModel();
        $data = $product->find($id);

        if ($data) {
            $product->delete($id);