app/Controllers/Sale.php

    public function create()
    {
        $sale = new SaleModel();
        $data = $this->request->getPost();

        if ($this->validate('sales')) {

            $id = $sale->insert([
                'price_amount' => $data['price_amount'],
                'users_id' => $data['users_id'],
                'products_id' => $data['products_id'],
                'status' => $data['status'],
            ]);
---
INSERT INTO "sales" ("price_amount", "users_id", "products_id", "status", "created_at", "updated_at") VALUES ('800.00', '1', '13', 'Pago', '2023-10-16 12:52:17', '2023-10-16 12:52:17')

    public function delete($id = null)
    {
        $sale = new SaleModel();
        $data = $sale->find($id);
---
SELECT *
FROM "sales"
WHERE "sales"."id" = '4'