app/Controllers/User.php

    public function create()
    {
        $user = new UserModel();
        $data = $this->request->getPost();

        if ($this->validate('users')) {

            $type_client =  strlen($data['cpf_cnpj']) == 11 ? 'PF' : 'PJ';

            $id = $user->insert([
                'name_or_fantasy' => $data['name_or_fantasy'],
                'cpf_cnpj' => $data['cpf_cnpj'],
                'address' => $data['address'],
                'type_user' => $type_client,
            ]);
---
INSERT INTO "users" ("name_or_fantasy", "cpf_cnpj", "address", "type_user", "created_at", "updated_at") VALUES ('Anto Socorro', '19856456695890', 'Caldas Novas 4', 'PJ', '2023-10-16 14:37:37', '2023-10-16 14:37:37')

    public function delete($id = null)
    {
        $user = new UserModel();
        $data = $user->find($id);

        if ($data) {
            $user->delete($id);
---
SELECT *
FROM "users"
WHERE "users"."id" = '2'
DELETE FROM "users"
WHERE "id" IN ('2')